export default {
  '/api/menuDrawer/query': {
    data: [
      {
        id: '1',
        name: '机构信息设置',
        children: [
          {
            id: '11',
            name: '销售机构设置',
          },
          {
            id: '12',
            name: '关联机构设置',
          },
          {
            id: '13',
            name: '销售商代销设置',
          },
        ],
      },
      {
        id: '2',
        name: '关联信息设置',
        children: [
          {
            id: '21',
            name: '基金账户预分配',
          },
          {
            id: '22',
            name: '销售商折扣限制',
          },
        ],
      },
      {
        id: '3',
        name: '业绩提成方案',
        children: [
          {
            id: '31',
            name: '业绩提成方案设置',
          },
        ],
      },
      {
        id: '4',
        name: '基金拆分方案流程',
        children: [
          {
            id: '41',
            name: '基金拆分方案设置',
          },
        ],
      },
      //   {
      //     id: 111,
      //     subMenu: [
      //       {
      //         id: '1',
      //         name: '机构信息设置',
      //         children: [
      //           {
      //             id: '11',
      //             name: '销售机构设置',
      //           },
      //           {
      //             id: '12',
      //             name: '关联机构设置',
      //           },
      //           {
      //             id: '13',
      //             name: '销售商代销设置',
      //           },
      //         ],
      //       },
      //       {
      //         id: '2',
      //         name: '关联信息设置',
      //         children: [
      //           {
      //             id: '21',
      //             name: '基金账户预分配',
      //           },
      //           {
      //             id: '22',
      //             name: '销售商折扣限制',
      //           },
      //         ],
      //       },
      //       {
      //         id: '3',
      //         name: '业绩提成方案',
      //         children: [
      //           {
      //             id: '31',
      //             name: '业绩提成方案设置',
      //           },
      //         ],
      //       },
      //       //   {
      //       //     id: '4',
      //       //     name: '基金拆分方案流程',
      //       //     children: [
      //       //       {
      //       //         id: '41',
      //       //         name: '基金拆分方案设置',
      //       //       },
      //       //     ],
      //       //   },
      //     ],
      //   },
      //   {
      //     id: 222,
      //     subMenu: [
      //       {
      //         id: '1',
      //         name: '机构信息设置',
      //         children: [
      //           {
      //             id: '11',
      //             name: '销售机构设置',
      //           },
      //           {
      //             id: '12',
      //             name: '关联机构设置',
      //           },
      //           {
      //             id: '13',
      //             name: '销售商代销设置',
      //           },
      //         ],
      //       },
      //     ],
      //   },
      //   {
      //     id: 333,
      //     subMenu: [
      //       {
      //         id: '1',
      //         name: '机构信息设置',
      //         children: [
      //           {
      //             id: '11',
      //             name: '销售机构设置',
      //           },
      //           {
      //             id: '12',
      //             name: '关联机构设置',
      //           },
      //           {
      //             id: '13',
      //             name: '销售商代销设置',
      //           },
      //         ],
      //       },
      //       {
      //         id: '2',
      //         name: '关联信息设置',
      //         children: [
      //           {
      //             id: '21',
      //             name: '基金账户预分配',
      //           },
      //           {
      //             id: '22',
      //             name: '销售商折扣限制',
      //           },
      //         ],
      //       },
      //       {
      //         id: '3',
      //         name: '业绩提成方案',
      //         children: [
      //           {
      //             id: '31',
      //             name: '业绩提成方案设置',
      //           },
      //         ],
      //       },
      //     ],
      //   },
    ],
    success: true,
    code: 200,
  },
};
